# MICROSOFT'S ENTRY INTO THE MOVIE INDUSTRY

## BUSINESS UNDERSTANDING
This project aims to have an in-depth look into the possibility of Microsoft joining the movie industry as a key player.

## DATA SOURCES
Data analysis will be sourced from several databases.
Financial records pertaining to grossing figures and movie budgets will be sourced from Box Office Movies, IMDB, TMDB and TN databases

In [1]:
#Importing necessary libraries
import pandas as pd 
import seaborn as sns
import sqlite3 as sql
import csv
import matplotlib.pyplot as plt
%matplotlib inline

# IMDB DATASET

This dataset contains a trove of information regarding movies and will be retrieved below; table by table.

In [2]:
conn = sql.connect('im.db')
cursor = conn.cursor()  
IMDB = pd.read_sql("""SELECT name FROM sqlite_master WHERE type = 'table';""", conn)
IMDB

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

## Movie Basics table
This dataset contains a movie id that corresponds with the titles,genres, the year each movie started running and how long it runs for

In [3]:
movie_basics_table = pd.read_sql("SELECT * FROM movie_basics;", conn)
movie_basics_table.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

## Movie Ratings Table

Movie ratings contains movie IDs, number of votes and average rating

In [4]:
movie_ratings_table = pd.read_sql('SELECT * FROM movie_ratings;', conn)
movie_ratings_table.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

## Movie AKA Table

This table contains information regarding movie release orders, titles, region, languages, attributes, types and if the title in the title column is the original title

In [5]:
movie_akas_table = pd.read_sql('SELECT * FROM movie_akas;', conn)
movie_akas_table.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0

## Known_for Table

This table displays a person's ID in the movie industry and the movie ID for the movie that they are known for.

In [6]:
known_for_table = pd.read_sql('SELECT * FROM known_for;', conn)
known_for_table.head()

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534

## Principal's Table

This table has infromtion regarding people who work in the movie industry. It matches each indiviadual to a movie, job, category and character.

In [7]:
principals_table = pd.read_sql('SELECT * FROM principals;', conn)
principals_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

# BOX OFFICE MOVIE DATASET

This file has data about movie titles, studios that produced them, the year they were produced and the gross total in domestic and foreign markets

In [8]:
bom = pd.read_csv('bom.movie_gross.csv')
bom.describe()
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

# THE MOVIE DATABASE
This dataset has genre IDs, original language and title, popularity, release date and title of the movie.

In [9]:
tmdb = pd.read_csv('tmdb.movies.csv')
tmdb.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

# MOVIE REVIEWS DATA
This tsv file contains reviews from critics. Themovie IDs, reviews, ratings, critic, top critic, publisher and ate are listed in arow corresponding to the movie ID

In [10]:
reviews = pd.read_csv('rt.reviews.tsv', sep='\t', encoding = 'latin -1')
reviews.info()
reviews.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

# MOVIE INFO TABLE

Here we have a variety of data including: ID, synopsis, rating, genre, director, writer, theater date, dvd_date, curency, box office, runtime and studio associated with a specific movie.

In [11]:
movie_info =  pd.read_csv('rt.movie_info.tsv', sep='\t')
movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

# MOVIE BUDGETS

Movie budgets is a table that looks at the production budget against the groosing figures for each movie in the dataset.

In [12]:
movie_budgets =  pd.read_csv('tn.movie_budgets.csv')
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

# DATA PREPARATION

1. Merging IMDB datasets

In [42]:
#Merge movie_basics_table and movie_akas_table using movie_id column
imdb_merge1= pd.merge(movie_basics_table, movie_akas_table, on = 'movie_id', how = 'outer')
# Drop duplicated and irrelevant columns
imdb_drop1= imdb_merge1.drop(['attributes','ordering','language', 'title', 'is_original_title'], axis= 1)
imdb_drop1.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,region,types
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",None,original
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None
4,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None

In [43]:
# Additional merge with movie ratings table
imdb_basics= pd.merge(imdb_drop1, movie_ratings_table, on = 'movie_id', how = 'outer')
imdb_basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 355545 entries, 0 to 355544
Data columns (total 10 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         355545 non-null  object
 1   primary_title    355545 non-null  object
 2   original_title   355513 non-null  object
 3   start_year       355545 non-null  int64
 4   runtime_minutes  314219 non-null  float64
 5   genres           348882 non-null  object
 6   region           278410 non-null  object
 7   types            168447 non-null  object
 8   averagerating    266085 non-null  float64
 9   numvotes         266085 non-null  float64
dtypes: float64(3), int64(1), object(6)
memory usage: 29.8+ MB

In [ ]:
imdb_basics['original_title'] = imdb_basics['original_title'].fillna('')
imdb_basics['region'] = imdb_basics['region'].fillna('')
imdb_basics['runtime_minutes'] = imdb_basics['runtime_minutes'].fillna('')
imdb_basics['genres'] = imdb_basics['genres'].fillna('')
imdb_basics['types'] = imdb_basics['types'].fillna('')
imdb_basics['averagerating'] = imdb['averagerating'].fillna('')
imdb_basics['numvotes'] = imdb_basics['numvotes']

personnel

In [80]:
personnel= pd.merge(known_for_table, principals_table, on = 'person_id')
personnel1= personnel.drop_duplicates(subset=['movie_id_x', 'movie_id_y'])
personnel2 = personnel1.drop(['ordering'], axis= 1)
personnel2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2593166 entries, 0 to 3278280
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   person_id   object
 1   movie_id_x  object
 2   movie_id_y  object
 3   category    object
 4   job         object
 5   characters  object
dtypes: object(6)
memory usage: 138.5+ MB

In [81]:
imdb_merge2= pd.merge(imdb_basics,personnel2,left_on='movie_id', right_on = 'movie_id_x')
imdb_drop2 = imdb_merge2.drop_duplicates()
imdb_drop3 =imdb_drop2.drop(['movie_id_x'], axis =1)
imdb_drop3.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,region,types,averagerating,numvotes,person_id,movie_id_y,category,job,characters
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None,7.0,77.0,nm1194313,tt1436327,writer,short story,None
1,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None,7.0,77.0,nm1194313,tt0063540,writer,story,None
2,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",IN,None,7.0,77.0,nm1194313,tt9266154,writer,story,None
3,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",None,original,7.0,77.0,nm1194313,tt1436327,writer,short story,None
4,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",None,original,7.0,77.0,nm1194313,tt0063540,writer,story,None

In [ ]:
df['title'] = df['title'].fillna('')
df['region'] = df['region'].fillna('')
df['language'] = df['language'].fillna('')
df['category'] = df['category'].fillna('')
df['job'] = df['job'].fillna('')
df['characters'] = df['characters'].fillna('')

A look at the top grossing domestic films from the BOM dataset

In [32]:
# Drop null values and sort resulting values in order from  highest
sorted_domestic= bom.dropna().sort_values(by='domestic_gross', ascending=False)[['title', 'year', 'domestic_gross']]
sorted_domestic.head(10)

                             title  year  domestic_gross
1872  Star Wars: The Force Awakens  2015     936700000.0
3080                 Black Panther  2018     700100000.0
3079        Avengers: Infinity War  2018     678800000.0
1873                Jurassic World  2015     652300000.0
727          Marvel's The Avengers  2012     623400000.0
2758      Star Wars: The Last Jedi  2017     620200000.0
3082                 Incredibles 2  2018     608600000.0
2323  Rogue One: A Star Wars Story  2016     532200000.0
2759   Beauty and the Beast (2017)  2017     504000000.0
2324                  Finding Dory  2016     486300000.0

A look at the top grossing foreign films in order from the highest

In [33]:

# bom['foreign_gross'] = bom['foreign_gross'].replace('9900000', pd.NA)
sorted_foreign_gross = bom.dropna().sort_values(by='foreign_gross', ascending=False)[['title', 'year', 'foreign_gross']]
sorted_foreign_gross.head(10)

                                           title  year foreign_gross
1331                                    The East  2013         99700
1805                             Life's a Breeze  2014         99700
3181                           Holmes and Watson  2018       9900000
1291                           Only God Forgives  2013       9900000
155   Sea Rex 3D: Journey to a Prehistoric World  2010       9900000
2906                            A United Kingdom  2017       9900000
510                                     Le Havre  2011       9900000
3225                                The Bookshop  2018       9900000
1546                          Heaven is for Real  2014       9900000
2100                           Maps to the Stars  2015        988000